# MarginType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..MarginType Property
PrintParameters Class See Also
---
The print margin type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MarginType MarginType { get; set; }
```

Visual Basic
---
```text
Public Property MarginType As MarginType
	Get
	Set
```

Visual C++
---
```text
public:
property MarginType MarginType {
	MarginType get ();
	void set (MarginType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the input argument is out of range. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the PaperPlacement is not Margins type. |

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace